reference/providers.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Reference - Providers</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-06-17 Thu"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet reference documentation for providers"/>
<meta name="keywords" content="pallet providers cloud api"/>
<link rel="stylesheet" type="text/css" href="../doc.css" />
</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Reference - Providers</h1>


<p>
Pallet uses <a href="http://jclouds.org">jclouds</a> to create, start and stop nodes.  In order to use the cloud,
you will need to specify your cloud credentials.  Each cloud has a slightly
different terminology for the username/key and password/secret.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Cloud Provider Names </h2>
<div class="outline-text-2" id="text-1">


<p>
In order to sign in to your cloud API, you will need to tell pallet the name of
your cloud.  The names pallet recognises can be displayed with the following:
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.compute)
(pallet.compute/supported-providers)
</pre>



</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Explicit credentials </h2>
<div class="outline-text-2" id="text-2">


<p>
You can log in to the cloud explicitly
</p>



<div class="org-src-container"><label class="org-src-name">explicit-credentials()</label><pre class="src src-clojure">
(<span style="color: #0000ff;">require</span> 'org.jclouds.compute)
(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">service</span> []
  (org.jclouds.compute/compute-service
   <span style="color: #f4a460;">"provider"</span> <span style="color: #f4a460;">"username"</span> <span style="color: #f4a460;">"password"</span> <span style="color: #0000ff;">:log4j</span> <span style="color: #0000ff;">:enterprise</span> <span style="color: #0000ff;">:ssh</span>))
</pre></div>



</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Credentials in settings.xml </h2>
<div class="outline-text-2" id="text-3">


<p>
Settings.xml is a maven file, often used to hold user specific configuration for
maven.  You can add your cloud provider information to this file, which is
normally located at <a href="/Users/duncan/.m2/settings.xml">~/.m2/settings.xml</a>.
</p>



<pre class="src src-nxml"><span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">settings</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">profiles</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">profile</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">id</span><span style="color: #00cd00;">&gt;</span>terremark<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">id</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">activation</span><span style="color: #00cd00;">&gt;</span>
        <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">activeByDefault</span><span style="color: #00cd00;">&gt;</span>true<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">activeByDefault</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">activation</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">properties</span><span style="color: #00cd00;">&gt;</span>
        <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">jclouds.compute.provider</span><span style="color: #00cd00;">&gt;</span>Your Cloud serivce name<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">jclouds.compute.provider</span><span style="color: #00cd00;">&gt;</span>
        <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">jclouds.compute.identity</span><span style="color: #00cd00;">&gt;</span>Your Cloud API username or key<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">jclouds.compute.identity</span><span style="color: #00cd00;">&gt;</span>
        <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">jclouds.compute.credential</span><span style="color: #00cd00;">&gt;</span>Your Cloud API secret or password<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">jclouds.compute.credential</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">properties</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">profile</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">profiles</span><span style="color: #00cd00;">&gt;</span>
<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">settings</span><span style="color: #00cd00;">&gt;</span>
</pre>



<p>
You can then use this information with pallet:
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.compute)
(<span style="color: #4682b4;">def</span> <span style="color: #0000ff;">service</span> (pallet.compute/compute-service-from-settings))
</pre>




</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2010-06-17 Thu</p>
<p class="creator">HTML generated by org-mode 6.36trans in emacs 24</p>
</div>
</div>
</body>
</html>
